loadTest.yml
config:
  target: 'http://localhost:8010'
  phases:
    - duration: 60
      arrivalRate: 150
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - post:
          url: '/rides'
          json:
            start_lat: 10
            start_long: 10
            end_lat: 10
            end_long: 10
            rider_name: 'Rizky'
            driver_name: 'Eddy'
            driver_vehicle: 'Yamaha'
      - get:
          url: '/rides'
      - get:
          url: '/rides/1'